mylist = [['J', '1', '8', '2', 'K', '3', '9', '4', 'Q', '5', '10', '6', '王', '7'], \
          ['7', '1', 'Q', '2', '8', '3', 'J', '4', '9', '5', 'K', '6', '10'],\
          ['J', '1', '7', '2', '10', '3', '8', '4', 'Q', '5', '9', '6'], \
          ['6', '1', '9', '2', '7', '3', 'J', '4', '8', '5', '10'], \
          ['8', '1', '6', '2', '10', '3', '7', '4', '9', '5'], \
          ['5', '1', '9', '2', '6', '3', '8', '4', '7'], \
          ['8', '1', '5', '2', '7', '3', '6', '4'], \
          ['4', '1', '3', '2', '5', '3', '7'], \
          ['5', '1', '4', '2', '6', '3'], \
          ['3', '1', '5', '2', '4'], \
          ['4', '1', '3', '2'],\
          ['2', '1', '3'], \
          ['2', '1'],\
          ['1']]
num = 0
while 0 < len(mylist) :
    print_list = [] #创建一个新列表，用于打印排好序的内容
    while 0 < len(mylist[num]) :
        p_num = mylist[num].pop(0)  #删除列表首位的元素,赋值给p_num
        mylist[num].append(p_num)   #把刚才删除的元素p_num，添加到列表最后
        p_num2 = mylist[num].pop(0) #这次删除的是排好序的首个元素，赋值给p_num2
        print_list.append(p_num2) #把刚才删除的元素p_num2，添加到新列表中print_list，用来打印
    print(print_list)
    #break
    num += 1